{
  "day": 2,
  "topic": "Present Perfect (I have done)  ",
  "sections": [
    {
      "title": "Introduction",
      "content": "Welcome to the eighth unit of our English learning journey. Today, we'll continue exploring the Present Perfect tense, expressed as 'I have done'"
    },
    {
      "title": "Definition",
      "content": "This tense remains essential for discussing past actions with relevance to the present. Let's delve deeper into its nuances."
    },
    {
      "title": "Formation",
      "content": "Subject + have/has + past participle.",
      "points": [
        "Quick review of the basic structure for clarity."
      ]
    },
    {
      "title": "Usage",
      "content": "Describe actions that started in the past and continue up to the present moment.",
      "points": [
        "I have lived in this city since 2010",
        "Discuss scenarios where multiple actions or events have occurred.",
        "She has written three novels and composed numerous songs."
      ]
    },
    {
      "title": "Examples",
      "content": "Let's examine examples to illustrate the application of the Present Perfect tense, emphasizing duration and multiple actions:",
      "examples": [
        {
          "Positive": "They have known each other for over a decade",
          "Negative": "I have not seen that movie yet",
          "Interrogative": "Has he ever visited Asia?"
        }
      ]
    },
    {
      "title": "Time Expression",
      "content": "Revisit and introduce additional time expressions relevant to the extended usage of the present perfect tense.",
      "points": [
        "Since, for, just, recently, over the years"
      ]
    },
    {
      "title": "Common Mistakes",
      "content": "Address common mistakes related to the extended usage of the present perfect tense.",
      "points": [
        "Incorrect:I live here since 2010",
        "Correct: I have lived here since 2010."
      ]
    },
    {
      "title": "Recap and Summary:",
      "content": "In summary, the extended use of the Present Perfect tense emphasizes duration and multiple actions. This helps convey a more comprehensive picture of past experiences with relevance to the present."
    },
    {
      "title": "Additional Resources:",
      "content": "For additional practice and reinforcement, consider exploring online exercises or referring to reliable grammar guides."
    },
    {
      "title": "Conclusion",
      "content": "Thank you for joining today's extended exploration of the Present Perfect tense. Practice using it in various contexts, and feel free to reach out if you have any questions. Happy learning!"
    }
  ]
}