{
    "day": 4,
    "topic": "Present Perfect Continuous and Simple (I have been doing and I have done)",
    "sections": [
      {
        "title": "Introduction",
        "content": "Welcome to the tenth unit of our English learning journey. In this unit, we'll explore the dynamic interplay between the Present Perfect Continuous and Present Perfect Simple"
      },
      {
        "title": "Definition",
        "content": "tenses—expressed as 'I have been doing' and 'I have done.' Understanding when to use each tense is crucial for effective communication. Let's delve into the key concepts."
      },
      {
        "title": "Formation Present Perfect Continuous ",
        "content": "Subject + have/has + been + verb-ing",
        "points": [
          "I have been playing"
        ]
      },
      {
        "title": "Usage Present Perfect Continuous",
        "content": "Emphasizes the duration and ongoing nature of an action that started in the past and may still be happening",
        "points": [
          "I have been studying for two hours."
        ]
      },
      {
        "title": "Formation Perfect Simple",
        "content": "Use the base form of the verb. Add 's' or 'es' for third-person singular subjects",
        "points": [
          "Rani has broken her arm."
        ]
      },
      {
        "title": "Usage Present Simple",
        "content": ": Describes completed actions with a connection to the present.",
        "points": [
          "I have visited that museum"
        ]
      },
      {
        "title": "Examples Perfect Continuous",
        "content": "Let's examine examples to illustrate the application of Present Perfect Continuous and Simple tenses:",
        "examples": [
          {
            "Positive": "She has been working at the company since last year.",
            "Negative": "They have not been watching TV all day.",
            "Interrogative": "Have you been studying Spanish recently?"
          }
        ]
      },
      {
        "title": "Examples Perfect Simple",
        "content": "Let's examine examples to illustrate the distinction between Present Continuous and Present Simple",
        "examples": [
          {
            "Positive": "We have visited Paris three times",
            "Negative": "I have not finished my assignment yet.",
            "Interrogative": "Has he ever visited Asia?"
          }
        ]
      },
      {
        "title": "Time Expression",
        "content": "Understanding time expressions is crucial for distinguishing between the two tenses.",
        "points": [
          "Present Perfect Continuous: For, since, all day, lately, recently.",
          "Present Perfect Simple: Already, just, yet, ever, never."
        ]
      },
      {
        "title": "Common Mistakes",
        "content": "Address common mistakes related to the confusion between Present Perfect Continuous and Simple.",
        "points": [
          "Incorrect:'I have been knowing her for years",
          "Correct: 'I have known her for years"
        ]
      },
      {
        "title": "Recap and Summary:",
        "content": "In summary, understanding the nuances between Present Perfect Continuous and Simple is crucial for effective communication. The continuous tense emphasizes ongoing actions, while the simple tense focuses on completed actions with a connection to the present."
      },
      {
        "title": "Additional Resources:",
        "content": "For additional practice and reinforcement, consider exploring online exercises or referring to reliable grammar guides."
      },
      {
        "title": "Conclusion",
        "content": "Thank you for joining today's lesson on the interplay between Present Perfect Continuous and Simple tenses. Practice using each tense appropriately, and feel free to reach out if you have any questions. Happy learning!"
      }
    ]
  }